spec/vcr_cassettes/EuPago_Api_V1_CreditCard/_payment/when_success/get_staus_without_paying_a_one_time_credit_card_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox.eupago.pt/api/v1.02/creditcard/create
    body:
      encoding: UTF-8
      string: '{"payment":{"identifier":"Test One time credit card payment","amount":{"currency":"EUR","value":10},"successUrl":"https://www.test.com/success","failUrl":"https://www.test.com/fail","backUrl":"https://www.test.com/back","lang":"PT","minutesFormUp":1440}}'
    headers:
      Content-Type:
      - application/json
      Accept:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: Created
    headers:
      Server:
      - nginx/1.20.1
      Date:
      - Sun, 28 Dec 2025 12:23:49 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Powered-By:
      - PHP/8.0.30
      Expires:
      - Thu, 19 Nov 1981 08:52:00 GMT
      Cache-Control:
      - no-store, no-cache, must-revalidate
      Pragma:
      - no-cache
      Strict-Transport-Security:
      - max-age=31536000;
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Referrer-Policy:
      - no-referrer
    body:
      encoding: UTF-8
      string: '{"transactionStatus":"Success","transactionID":"FILTERED","reference":"FILTERED","redirectUrl":"FILTERED"}'
  recorded_at: Sun, 28 Dec 2025 12:23:49 GMT
- request:
    method: post
    uri: https://sandbox.eupago.pt/api/auth/token
    body:
      encoding: UTF-8
      string: grant_type=client_credentials&client_id=<EUPAGO_CLIENT_ID>&client_secret=<EUPAGO_CLIENT_SECRET>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx/1.20.1
      Date:
      - Sun, 28 Dec 2025 12:23:50 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Powered-By:
      - PHP/8.0.30
      Expires:
      - Thu, 19 Nov 1981 08:52:00 GMT
      Cache-Control:
      - no-store, no-cache, must-revalidate
      Pragma:
      - no-cache
      Strict-Transport-Security:
      - max-age=31536000;
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Referrer-Policy:
      - no-referrer
    body:
      encoding: UTF-8
      string: '{"transactionStatus":"Success","access_token":"FILTERED","token_type":"Bearer","expires_in":432000}'
  recorded_at: Sun, 28 Dec 2025 12:23:50 GMT
- request:
    method: get
    uri: https://sandbox.eupago.pt/api/management/v1.02/references/info?reference=FILTERED
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/json
      Accept:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx/1.20.1
      Date:
      - Sun, 28 Dec 2025 12:23:50 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Powered-By:
      - PHP/8.0.30
      Expires:
      - Thu, 19 Nov 1981 08:52:00 GMT
      Cache-Control:
      - no-store, no-cache, must-revalidate
      Pragma:
      - no-cache
      Strict-Transport-Security:
      - max-age=31536000;
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Referrer-Policy:
      - no-referrer
    body:
      encoding: UTF-8
      string: '{"transactionStatus":"Success","referenceList":[{"reference":"FILTERED","entity":"10047","amount":"10.00000","datetime":"2025-12-28T12:23:49Z","status":"pendente","identifier":"Test
        One time credit card payment"}]}'
  recorded_at: Sun, 28 Dec 2025 12:23:50 GMT
recorded_with: VCR 6.3.1
