spec/vcr_cassettes/EuPago_Api_V1_CreditCard/_subscription/when_failure/Missing_Authorization_returns_401.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox.eupago.pt/api/v1.02/creditcard/subscription
    body:
      encoding: UTF-8
      string: amount=1000&currency=EUR
    headers:
      Content-Type:
      - application/json
      Accept:
      - application/json
      User-Agent:
      - ''
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 401
      message: Unauthorized
    headers:
      Server:
      - nginx/1.20.1
      Date:
      - Fri, 12 Sep 2025 16:36:19 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Powered-By:
      - PHP/8.0.30
      Expires:
      - Thu, 19 Nov 1981 08:52:00 GMT
      Cache-Control:
      - no-store, no-cache, must-revalidate
      Pragma:
      - no-cache
    body:
      encoding: UTF-8
      string: '{"transactionStatus":"Rejected","code":"APIKEY_MISSING","text":"API
        Key was not available in the request"}'
  recorded_at: Fri, 12 Sep 2025 16:36:19 GMT
recorded_with: VCR 6.3.1
